var toDegree = function(s) {
  if (s === undefined || s === null) {
    return '';
  }
  var pre = '';
  if (s < 0.0) {
    s = -s;
    pre = '-';
  }
  var d = Math.floor(s);
  s -= d;
  s *= 60;
  var m = Math.floor(s);
  s -= m;
  s *= 60;
  return pre + d + '°' + m + '\'' + Math.floor(s);
};
var d = {
  'houses': [
    213.0959218376256,
    242.05087383038767,
    273.062578277904,
    305.5990239192098,
    337.90188223351663,
    7.477994362116192,
    33.09592183762561,
    62.05087383038767,
    93.06257827790398,
    125.5990239192098,
    157.90188223351666,
    187.47799436211622
  ],
  'planets': {
    'sun': { 'name': 'sun', 'lon': 316.77946707861236, 'lat': 0.00019243916068320852, 'spd': 1.0065423256833128, 'inSign': '水瓶', 'inSignPo': 1, 'inHouse': 4 },
    'moon': { 'name': 'moon', 'lon': 325.5967796727515, 'lat': -1.309202215218832, 'spd': 10.622474424053507, 'inSign': '水瓶', 'inSignPo': 1, 'inHouse': 4 },
    'mercury': { 'name': 'mercury', 'lon': 334.2017563304168, 'lat': 1.3345984986398063, 'spd': 0.4842384251446674, 'inSign': '双鱼', 'inSignPo': 0, 'inHouse': 4 },
    'venus': { 'name': 'venus', 'lon': 301.76953385124443, 'lat': -0.6324766271288154, 'spd': 1.2489838931628583, 'inSign': '水瓶', 'inSignPo': 1, 'inHouse': 3 },
    'mars': { 'name': 'mars', 'lon': 328.9865728551803, 'lat': -1.0417141829616177, 'spd': 0.7868481966966101, 'inSign': '水瓶', 'inSignPo': 1, 'inHouse': 4 },
    'jupiter': { 'name': 'jupiter', 'lon': 190.16494263550166, 'lat': 1.4652462396963855, 'spd': -0.034719254671244926, 'inSign': '天秤', 'inSignPo': 5, 'inHouse': 12 },
    'saturn': { 'name': 'saturn', 'lon': 189.4971809496408, 'lat': 2.520673750371352, 'spd': -0.02989352154258995, 'inSign': '天秤', 'inSignPo': 5, 'inHouse': 12 },
    'uranus': { 'name': 'uranus', 'lon': 239.7729268832746, 'lat': 0.22523567961234583, 'spd': 0.024678657979393392, 'inSign': '天蝎', 'inSignPo': 4, 'inHouse': 1 },
    'neptune': { 'name': 'neptune', 'lon': 264.19173411925647, 'lat': 1.3089231512569888, 'spd': 0.025487761092790606, 'inSign': '射手', 'inSignPo': 3, 'inHouse': 2 },
    'pluto': { 'name': 'pluto', 'lon': 204.31537172929686, 'lat': 17.342659821909372, 'spd': -0.005579537116773281, 'inSign': '天秤', 'inSignPo': 5, 'inHouse': 12 },
    'mean_node': { 'name': 'mean_node', 'lon': 130.62514818256926, 'lat': 0, 'spd': -0.05296124982123729, 'inSign': '狮子', 'inSignPo': 7, 'inHouse': 10 },
    'asc': { 'name': 'asc', 'lon': 213.0959218376256, 'inSign': '天蝎', 'inSignPo': 4, 'inHouse': 12 },
    'mc': { 'name': 'mc', 'lon': 125.5990239192098, 'inSign': '狮子', 'inSignPo': 7, 'inHouse': 9 }
  },
  'asc': 213.0959218376256,
  'mc': 125.5990239192098,
  'elements': { 'fire': 2, 'water': 3, 'earth': 0, 'air': 7 },
  'aspects': [
    ['trine', 'sun', 'jupiter', 6.614524443110696, -1],
    ['opposition', 'sun', 'mean_node', 6.154318896043094, -1],
    ['conjunct', 'moon', 'mars', 3.389793182428832, 1],
    ['square', 'moon', 'uranus', 4.176147210523112, -1],
    ['sextile', 'moon', 'neptune', 1.4050455534950288, -1],
    ['trine', 'moon', 'pluto', 1.2814079434546386, -1],
    ['conjunct', 'mercury', 'mars', 5.215183475236472, 1],
    ['square', 'mercury', 'uranus', 4.428829447142192, -1],
    ['trine', 'mercury', 'asc', 1.105834492791189, 0],
    ['sextile', 'venus', 'uranus', 1.996606967969825, -1],
    ['square', 'venus', 'asc', 1.326387986381178, 0],
    ['opposition', 'venus', 'mc', 3.8294900679653665, 0],
    ['square', 'mars', 'uranus', 0.78635402809428, -1],
    ['sextile', 'mars', 'neptune', 4.794838735923861, -1],
    ['trine', 'mars', 'pluto', 4.671201125883471, -1],
    ['trine', 'mars', 'asc', 4.109348982445283, 0],
    ['conjunct', 'jupiter', 'saturn', 0.667761685860853, -1],
    ['sextile', 'jupiter', 'mean_node', 0.4602055470676021, 1],
    ['sextile', 'jupiter', 'mc', 4.565918716291861, 0],
    ['sextile', 'saturn', 'mean_node', 1.1279672329284551, 1],
    ['sextile', 'saturn', 'mc', 3.8981570304310083, 0],
    ['trine', 'uranus', 'mc', 5.826097035935192, 0],
    ['sextile', 'neptune', 'pluto', 0.1236376100403902, -1],
    ['conjunct', 'mean_node', 'mc', 5.026124263359463, 0],
    ['square', 'asc', 'mc', 2.5031020815841885, 0]
  ]
};


for (var i in d.planets) {
  var p = d.planets[i];
  console.log('p:%s, lat:%s, %d', i, toDegree(p.lat), p.lon-d.asc);
}


/*
@0203  ; Astrolog chart positions.
/zi "" ""
/YF Sun: 16 Aqu 46.890971047,   0  0.003351904,   1.013850370   0.986138564
/YF Moo: 26 Aqu 20.545076221,  -1 24.496063475,  13.962596297   0.002495426
/YF Mer:  4 Pis 12.212813356,   1 20.055327609,   0.496565179   0.857280228
/YF Ven:  1 Aqu 46.255338448,   0 37.955848507,   1.251518023   1.633613065
/YF Mar: 28 Aqu 59.234282224,  -1  2.507321753,   0.791216378   2.329074538
/YF Jup: 10 Lib  9.896898451,   1 27.914372819,  -0.037709053   4.800553994
/YF Sat:  9 Lib 29.836657375,   2 31.242358420,  -0.031527141   8.912173693
/YF Ura: 29 Sco 46.380563001,   0 13.515607181,   0.024494143  18.992393697
/YF Nep: 24 Sag 11.505355519,   1 18.537475624,   0.025816903  30.866001555
/YF Plu: 24 Lib 18.921233307,  17 20.558959559,  -0.005976910  29.705511852
/YF Nod: 10 Leo 37.509003189,   0  0.000000000,  -0.052961602   0.002569555
/YF For: 13 Sco 39.279814556,   0  0.000000000, 360.000000000  14.725629947
/YF Asc:  4 Sco  5.625709382,   0  0.000000000, 360.000000000  14.725629947
/YF 2nd:  3 Sag  2.549310787,   0  0.000000000, 360.000000000  14.725629947
/YF 3rd:  4 Cap 14.184161645,   0  0.000000000, 360.000000000  14.725629947
/YF IC


 */
